//Скачайте проект Mazes и изучите его. Там заготовлены несколько фиксированных лабиринтов.
//В каждом лабиринте вам нужно довести робота до выхода — клетки, помеченной зеленым кружком.

//Сам лабиринт не известен и у робота нет сенсоров, чтобы его исследовать, но известен тип лабиринта и его размеры.

//Этого достаточно, чтобы построить маршрут и отдать нужные команды роботу.

//В этой задаче лабиринт — это пустая комната, окружённая стеной по периметру, в которой из верхнего левого угла с координатами
//(1, 1) нужно пройти в правый нижний с координатами (width-2, height-2).

//Дополнительные ограничения:

//Запрещено использовать более одного цикла в одном методе.
//Запрещено иметь методы длиннее 6 строк кода.
//Запрещено использовать ключевое слово catch
//Разрешено создавать вспомогательные методы, но только понятными именами, в том числе именами аргументов.