//Ваша задача привести код в этом файле в порядок. Для начала запустите эту программу. Должно появиться окно с изображением невозможного квадрата.
//Переименуйте всё, что называется неправильно. Это можно делать двойным нажатием комбинации клавиш Ctrl+R (работает для VS и Rider).
//Исправьте форматирование кода. Частично с этим поможет комбинация клавиш: Ctrl + K, Ctrl + D для VS, Ctrl+Alt+L для Rider, Ctrl+Alt+Enter для Rider, использующий схему клавиш VS.
//Повторяющиеся части кода вынесите во вспомогательные методы. Это можно сделать, выделив несколько строк кода и нажав: Ctrl + R, Ctrl + M для VS, Ctrl+Alt+M для Rider.
//Избавьтесь от всех зашитых в коде числовых констант — положите их в переменные с понятными именами.