//В классе HistogramTask напишите код подготовки данных для гистограммы частоты рождаемости в зависимости от числа (номера дня в месяце) их рождения для заданного имени.

//В это задаче используются реальные данные о людях. Но так получилось, что в базе данных для всех людей с
//неизвестной датой рождения, в качестве даты рождения используется первое число месяца. Во время работы с реальными базами данных, часто всплывают подобные особенности.

//Чтобы это не мешало нам в этой задаче, просто не учитывайте тех, кто родился 1 числа любого месяца.

//В качестве подписей (label) по оси X используйте массив размером 31 элемент со значениями от 1 до 31.

//Если вас пугает незнакомое слово гистограмма — вам как обычно в википедию!

//Пример подготовки данных для гистограммы смотри в файле HistogramSample.cs

//Проанализируйте наблюдаемый результат для имён Владимир и Юрий. Попробуйте найти объяснение такой форме гистограмм?

//В этой и следующих задачах, ваш код должен корректно работать на любых данных, а не только на том наборе, которые содержится в архиве с задачей. Это проверяется секретными тестами.