//¬ас€ сменил пароль на новый и забыл его!

//Ќа этот раз он точно помнит, что он сконструировал пароль из старого парол€, помен€в регистр нескольких букв. ќн, конечно, не хочет вам говорить старый пароль,
//поэтому просит написать программу, котора€ по заданному слову перебирает все возможные пароли, полученные из этого слова заменой регистра.

//ƒл€ удобства мы создали дл€ вас проект, который будет тестировать вашу программу. ¬ам лишь остаетс€ дописать класс CaseAlternatorTask в одноименном файле.

//ƒл€ удобства ¬ас€ просит, чтобы пароли по€вл€лись в лексикографическом пор€дке, счита€, что маленькие буквы меньше больших. ≈стественно, регистр нужно мен€ть только у букв.

//Ќапример, дл€ входного слова 'ab42' результат должен быть такой: 'ab42', 'aB42', 'Ab42', 'AB42'

//Ќа вход подаетс€ слово в нижнем регистре. ¬ результирующем списке не должно быть повторений слов.