//Наконец, вы готовы к тому, чтобы реализовать всю задачу, поставленную два слайда назад!

//В классе FieldsParserTask реализуйте метод ParseLine, для которого вы создавали тесты в предыдущей задаче.

//Создайте модульные тесты на это решение и перенесите разработанные в прошлой задаче тестовые случаи в модульные тесты.

//Решение получится более простым, если ваши вспомогательные методы будут использовать Token в качестве возвращаемого значения.

//В качестве вспомогательных методов могут быть методы, читающие разные виды полей (у вас уже реализован метод ReadQuotedField), а также метод пропускающий пробелы между полями.